БИТУправление_медицинским_центром_демо/src/InformationRegisters/ОповещенияСотрудниковОПриходеКлиентов/ОповещенияСотрудниковОПриходеКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОповещенияСотрудниковОПриходеКлиентов</name>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.Заявка</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Documents/Заявка/Заявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заявка</name>
  <posting>Deny</posting>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>DefinedType.КомментарийДокумента</types>
    </type>
  </attributes>
  <attributes>
    <name>Перенесенная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НесколькоСотрудников</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.ВидыСостоянийЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеДляОтката</name>
    <type>
      <types>CatalogRef.ВидыСостоянийЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>Кабинет</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКлиента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХочуРаньше</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПримечаниеХочуРаньше</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборХочуРаньше</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеЗаписиВРасписание</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимДлительностиЗаявки</name>
    <type>
      <types>EnumRef.РежимДлительностиЗаявки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование1</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование2</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование3</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжительностьИзмененаВручную</name>
      <comment>Используется в форме заявки при установке нормативной продолжительности</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтборыХочуРаньше</name>
    <attributes>
      <name>Фильтр</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
        <types>CatalogRef.КатегорииВыработки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/ОповещенияСотрудниковОПриходеКлиентов/Forms/ОповещениеОПриходеКлиента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Сотрудник") Тогда 
		Сотрудник = Параметры.Сотрудник;
	Иначе
		Пользователь = ОбщегоНазначения.ТекущийПользователь();
		Сотрудник = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Пользователь, "Сотрудник");
	КонецЕсли;
	
	// Удаление неактуальных записей ожидающих оповещения
	НеактуальныеЗаписиОповещений = УправлениеЗаявками.ПолучитьЗаписиОповещенийОПриходеКлиентов(Сотрудник, Истина);
	УдалитьЗаписиКлиентовСервер(НеактуальныеЗаписиОповещений);
	
	// Вывод списка оповещений
	ЗаписиОповещений = Неопределено;
	Если Параметры.Свойство("ЗаписиОповещений") Тогда 
		ЗаписиОповещений = Параметры.ЗаписиОповещений;	
	КонецЕсли;
	
	ОбновитьЗаписиКлиентовСервер(ЗаписиОповещений);
	
	// Чтение настроек на форме
	ЧастотаЧтенияОповещений = РаботаСФормамиСервер.ПолучитьНастройкуФормы("ОповещенияОПриходеКлиентов", "ЧастотаЧтенияОповещений", 0);
	ЧастотаЧтенияОповещений = ЧастотаЧтенияОповещений / 60;
	 
	ПоказыватьОповещение = Не УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(,"СкрыватьОповещенияОПриходеКлиентов");
	Элементы.ЧастотаЧтенияОповещений.Доступность = ПоказыватьОповещение;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	// Удаление из регистра записей для оповещений, показанных на форме
	ЗаписиОповещений = Новый Массив;
	Для Каждого СтрокаЗаписи Из ЗаписиКлиентов Цикл
		ЗаписиОповещений.Добавить(Новый Структура("Сотрудник, Заявка", Сотрудник, СтрокаЗаписи.Заявка));
	КонецЦикла;
	УдалитьЗаписиКлиентовСервер(ЗаписиОповещений);
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройку(Команда)
	
	НастройкиФормы = Новый Структура;
	НастройкиФормы.Вставить("ЧастотаЧтенияОповещений", ЧастотаЧтенияОповещений * 60);
	
	РаботаСФормамиСервер.СохранитьНастройкиФормы(НастройкиФормы, "ОповещенияОПриходеКлиентов");
	
	УправлениеПользователями.УстановитьЗначение(,"СкрыватьОповещенияОПриходеКлиентов", Не ПоказыватьОповещение);
	
	УправлениеЗаявкамиКлиент.УправлениеОбрботчикомОжиданияПриходКлиента(ПоказыватьОповещение);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЧастотаЧтенияОповещенийПриИзменении(Элемент)
	
	Элементы.СохранитьНастройку.Доступность = Истина;
	МаксимальноеВремя = УправлениеЗаявкамиКлиент.МаксимальнаяПериодичностьОповещенияОПриходеКлиента();
	Если ЧастотаЧтенияОповещений > МаксимальноеВремя Тогда
		ЧастотаЧтенияОповещений = МаксимальноеВремя;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьОповещениеПриИзменении(Элемент)
	
	Элементы.ЧастотаЧтенияОповещений.Доступность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписиКлиентовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьФорму("Документ.Заявка.ФормаОбъекта", Новый Структура("Ключ", Элементы.ЗаписиКлиентов.ТекущиеДанные.Заявка));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура УдалитьЗаписиКлиентовСервер(ЗаписиОповещений)

	Для Каждого ЗаписьОповещения Из ЗаписиОповещений Цикл
		Запись = РегистрыСведений.ОповещенияСотрудниковОПриходеКлиентов.СоздатьМенеджерЗаписи();
		Запись.Сотрудник = ЗаписьОповещения.Сотрудник;
		Запись.Заявка = ЗаписьОповещения.Заявка;
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			Попытка
				Запись.Удалить();
			Исключение
			КонецПопытки;
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

// Заполняет список записей при создании формы
&НаСервере
Процедура ОбновитьЗаписиКлиентовСервер(ЗаписиОповещений = Неопределено)
	
	Если ЗаписиОповещений = Неопределено Тогда  
		Если ЗначениеЗаполнено(Сотрудник) Тогда 
			ЗаписиОповещений = УправлениеЗаявками.ПолучитьЗаписиОповещенийОПриходеКлиентов(Сотрудник);
		КонецЕсли;	
	КонецЕсли;	
		
	Если ЗаписиОповещений <> Неопределено Тогда 
		Для Каждого Запись Из ЗаписиОповещений Цикл
			СтрокаЗапись = ЗаписиКлиентов.Добавить();
			СтрокаЗапись.Заявка = Запись.Заявка;
			СтрокаЗапись.Клиент = Запись.Заявка.Клиент;
			СтрокаУслуга = "";
			тДатаНачала = Дата(3000,1,1);
			Для Каждого СтрокаРаботы Из Запись.Заявка.Работы Цикл
				Если (ЗначениеЗаполнено(СтрокаРаботы.Сотрудник) И СтрокаРаботы.Сотрудник = Сотрудник)
					Или (Не ЗначениеЗаполнено(СтрокаРаботы.Сотрудник) И Запись.Заявка.Сотрудник = Сотрудник) Тогда 
					Если ЗначениеЗаполнено(СтрокаРаботы.Номенклатура) Тогда 
						СтрокаУслуга = СтрокаУслуга + ?(СтрокаУслуга = "", "", ", ") + Строка(СтрокаРаботы.Номенклатура);					
					КонецЕсли;
					тДатаНачала = Мин(тДатаНачала, СтрокаРаботы.ДатаНачала);
				КонецЕсли;
			КонецЦикла;
			СтрокаЗапись.ДатаНачала = тДатаНачала;
			СтрокаЗапись.Услуга = СтрокаУслуга;
		КонецЦикла;
		ЗаписиКлиентов.Сортировать("ДатаНачала");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
